#### Q7. People csv and joins

In [1]:
#import pandas library
import pandas as pd

In [2]:
# reading the people files in dataframes
people1 = pd.read_csv('people1.csv')
people2 = pd.read_csv('people2.csv')

In [3]:
people1, people2

(   age  gender    marital  income
 0   23    male    married     360
 1   58    male    married     520
 2   42  female    married     880
 3   30  female  unmarried     460
 4   43    male    married     590
 5   51    male  unmarried     710
 6   29    male    married     620
 7   37  female  unmarried     350
 8   33  female    married     290
 9   46    male    married     440,
     age  gender    marital  income
 0    23    male    married     360
 1    63    male    married     640
 2    20  female  unmarried     930
 3    44  female  unmarried     340
 4    43    male    married     590
 5    51    male  unmarried     710
 6    29    male    married     620
 7    36  female    married     770
 8    33  female    married     510
 9    35    male    married     550
 10   27    male  unmarried     600
 11   49  female  unmarried     420
 12   34  female    married     680)

###### Using the data frames people1.csv and people2.csv, perform the following operations:

a) get the rows that can be found in both data frames

In [4]:
merged_data = pd.merge(left= people1, right= people2, how= 'inner' )
print(merged_data)

   age gender    marital  income
0   23   male    married     360
1   43   male    married     590
2   51   male  unmarried     710
3   29   male    married     620

b) join the data frames (discarding the common rows)

In [5]:
joined_data = pd.concat([people1, people2]).drop_duplicates(keep= False)
print(joined_data)

    age  gender    marital  income
1    58    male    married     520
2    42  female    married     880
3    30  female  unmarried     460
7    37  female  unmarried     350
8    33  female    married     290
9    46    male    married     440
1    63    male    married     640
2    20  female  unmarried     930
3    44  female  unmarried     340
7    36  female    married     770
8    33  female    married     510
9    35    male    married     550
10   27    male  unmarried     600
11   49  female  unmarried     420
12   34  female    married     680

c) get the rows that can be found in people1.csv, but not in people2.csv

In [6]:
left_merge_data = pd.merge(left= people1, right= people2, how= 'left', indicator= True)
left_merge_data

   age  gender    marital  income     _merge
0   23    male    married     360       both
1   58    male    married     520  left_only
2   42  female    married     880  left_only
3   30  female  unmarried     460  left_only
4   43    male    married     590       both
5   51    male  unmarried     710       both
6   29    male    married     620       both
7   37  female  unmarried     350  left_only
8   33  female    married     290  left_only
9   46    male    married     440  left_only

In [7]:
left_merge = left_merge_data[left_merge_data['_merge']== 'left_only'].drop(columns= '_merge')
print(left_merge)

   age  gender    marital  income
1   58    male    married     520
2   42  female    married     880
3   30  female  unmarried     460
7   37  female  unmarried     350
8   33  female    married     290
9   46    male    married     440

d) get the rows that can be found in people2.csv, but not in people1.csv

In [8]:
right_merge_data = pd.merge(people1, people2, how = 'right', indicator= True)
right_merge_data

    age  gender    marital  income      _merge
0    23    male    married     360        both
1    63    male    married     640  right_only
2    20  female  unmarried     930  right_only
3    44  female  unmarried     340  right_only
4    43    male    married     590        both
5    51    male  unmarried     710        both
6    29    male    married     620        both
7    36  female    married     770  right_only
8    33  female    married     510  right_only
9    35    male    married     550  right_only
10   27    male  unmarried     600  right_only
11   49  female  unmarried     420  right_only
12   34  female    married     680  right_only

In [9]:
right_merge = right_merge_data[right_merge_data['_merge']== 'right_only'].drop(columns= '_merge')
right_merge

    age  gender    marital  income
1    63    male    married     640
2    20  female  unmarried     930
3    44  female  unmarried     340
7    36  female    married     770
8    33  female    married     510
9    35    male    married     550
10   27    male  unmarried     600
11   49  female  unmarried     420
12   34  female    married     680

e) verify whether the data frames are identical

In [10]:
# here, we will have to use the EQUALS method

In [11]:
is_identical = people1.equals(people2)

In [12]:
if is_identical:
    print("The two dataframes are identical")
else:
    print("The two dataframes are not identical")

The two dataframes are not identical

equals method checks for equality in terms of the shape, column names, and values in the data frames. If the two data frames have the same shape, column names, and values, they will be considered identical.